[
  {
    "title": "",
    "review": "Site doesn't work most of the time. I'm using notion since 2020 I guess. Still can't make it my primary note taking app. Why? Cause there are millions of issues with the site. \nEven now I've sat do... See more",
    "date": "2024-12-28",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "I just received a change email address verification code from Notion.  I've never heard of Notion, nor do I have an account with them.  It's the weekend therefore I will have to wait to reach out to t... See more",
    "date": "2024-12-22",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Warning! Do not Pay for this shit, they will continue making withdrawals from your account after you cancel and it is impossible to get in touch with them. \nYesterday they withdrew 770USD from my acc... See more",
    "date": "2024-12-31",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Site doesn't work most of the time. I'm using notion since 2020 I guess. Still can't make it my primary note taking app. Why? Cause there are millions of issues with the site. \nEven now I've sat do... See more",
    "date": "2024-12-28",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "I just received a change email address verification code from Notion.  I've never heard of Notion, nor do I have an account with them.  It's the weekend therefore I will have to wait to reach out to t... See more",
    "date": "2024-12-22",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Warning! Do not Pay for this shit, they will continue making withdrawals from your account after you cancel and it is impossible to get in touch with them. \nYesterday they withdrew 770USD from my acc... See more",
    "date": "2024-12-31",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Site doesn't work most of the time. I'm using notion since 2020 I guess. Still can't make it my primary note taking app. Why? Cause there are millions of issues with the site. \nEven now I've sat do... See more",
    "date": "2024-12-28",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "I just received a change email address verification code from Notion.  I've never heard of Notion, nor do I have an account with them.  It's the weekend therefore I will have to wait to reach out to t... See more",
    "date": "2024-12-22",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Warning! Do not Pay for this shit, they will continue making withdrawals from your account after you cancel and it is impossible to get in touch with them. \nYesterday they withdrew 770USD from my acc... See more",
    "date": "2024-12-31",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Site doesn't work most of the time. I'm using notion since 2020 I guess. Still can't make it my primary note taking app. Why? Cause there are millions of issues with the site. \nEven now I've sat do... See more",
    "date": "2024-12-28",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "I just received a change email address verification code from Notion.  I've never heard of Notion, nor do I have an account with them.  It's the weekend therefore I will have to wait to reach out to t... See more",
    "date": "2024-12-22",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Warning! Do not Pay for this shit, they will continue making withdrawals from your account after you cancel and it is impossible to get in touch with them. \nYesterday they withdrew 770USD from my acc... See more",
    "date": "2024-12-31",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Site doesn't work most of the time. I'm using notion since 2020 I guess. Still can't make it my primary note taking app. Why? Cause there are millions of issues with the site. \nEven now I've sat do... See more",
    "date": "2024-12-28",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "I just received a change email address verification code from Notion.  I've never heard of Notion, nor do I have an account with them.  It's the weekend therefore I will have to wait to reach out to t... See more",
    "date": "2024-12-22",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Warning! Do not Pay for this shit, they will continue making withdrawals from your account after you cancel and it is impossible to get in touch with them. \nYesterday they withdrew 770USD from my acc... See more",
    "date": "2024-12-31",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "DO NOT USE for any sensitive material",
    "review": "DO NOT USE for any sensitive material! All of my data has been completely wiped. Hours upon hours of work all gone. Support could not care less either. While this app seems fun to use, do not store anything on there you are not okay with losing.",
    "date": "2024-12-31",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Site doesn't work most of the time",
    "review": "Site doesn't work most of the time. I'm using notion since 2020 I guess. Still can't make it my primary note taking app. Why? Cause there are millions of issues with the site. Even now I've sat down for a deep productive work. So decided to plan my thesis work. And voila. Notion not working. / doesn't bring any component menu. Page option button not working. Cannot drag gallery items. Cannot drag table items. And the list continues. This is it. I quit notion. Stupid app with no consistent interface.",
    "date": "2024-12-28",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Versatile software tool that caters to many use cases",
    "review": "I have been using Notion for a couple of years now. It has been a great experience. I have been using this tool for a variety of use cases. Which is usually not something you can do in most software tools. There is definitely a bit of a learning curve to fully utilize the potential of Notion, but if you put in the effort, you can use it to run your work and life.",
    "date": "2024-12-27",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Received Change Email Address Code, But Don't Have a Notion Account",
    "review": "I just received a change email address verification code from Notion.  I've never heard of Notion, nor do I have an account with them.  It's the weekend therefore I will have to wait to reach out to them.  I even searched my email history and have zero emails from Notion apart from this one today December 21, 2024.  This is scary troubling as either it's a phishing scam or someone is using my email address.",
    "date": "2024-12-22",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Delightful second mind if you learn to use it!",
    "review": "Notion seems like THE recommended tool by many of the productivity geeks nowadays. As a developer myself, seeing Notion get new and better features all the time as well as support for professional tools such as automations and database-like data managements is absolutely delightful. I used it to track many aspects of my university journey as well as building a virtual library for my physical books and notes. I was constantly surprised that \"omg.. it can also do this!\"",
    "date": "2024-12-20",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Bugs Bugs Bugs",
    "review": "",
    "date": "2024-12-20",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "This is my to go tool to basically everything",
    "review": "This is my go-to tool for planning and organizing my agency. It’s incredibly versatile: I use it for project management, building client dashboards, CRM, finance, and more. The best part? You can do it all for free. The only con is that the platform isn’t very intuitive. For example, when it comes to client dashboards, I often run into challenges helping clients understand how to use it effectively.",
    "date": "2024-12-10",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Great",
    "review": "Digital planner. Great customisable features.",
    "date": "2024-12-09",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Amazing tool",
    "review": "",
    "date": "2024-12-06",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "don't subscribe with them - they will restrict access",
    "review": "Because I was travelling and forgot to cancel my subscription, notion is keeping my Of course, they will reply with some corporate cringe below here probably but one thing is certain. I asked them to unlock my spaces to AT LEAST get the data out and they don't want Basically, they keep my business-critical content at ransom. Absolutely despicable. WIll move to another PM tool and never go back.",
    "date": "2024-12-03",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Using notion for organizing my life…",
    "review": "Using notion for organizing my life basically. It used to be better and simpler but I guess the advantage is that its more robust now. Could be a perk for more pro users, im just a basic one. I do like that the interface still manages to be relatively clean and simple but still, sometimes I feel that Notion becomes overly complex in the amount of functionalities",
    "date": "2024-12-02",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Useful for note taking and organization",
    "review": "I find Notion really useful for taking down notes, and creating useful databases. It also helps me to be organized as well - I use it to make lists of what I need to do. Best of all, you can create as many pages as you need - for free, with all the features you need. I recommend this app to everyone, especially those who need to take notes or plan. It also has AI, which can be really useful too if you need it to help you while you use the app.",
    "date": "2024-12-01",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Super, from A to Z",
    "review": "Offers a lot of things for free, with a Freemium economic model that is optional, which makes you want but does not restrict you. A good balance in my opinion: bravo",
    "date": "2024-11-30",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Customer Satisfaction",
    "review": "As a dedicated user of Notion, I am deeply dissatisfied with their response to a legitimate refund request concerning mistakenly added workspace members. Despite providing ample justification and acting promptly upon realizing the issue, Notion declined our request, hiding behind a rigid 72-hour policy. Their refusal to issue a refund disregards the exceptional circumstances we outlined, including the lack of activity from the mistakenly added members and the delayed awareness of charges due to limited notification methods. This approach is not only inflexible but also inconsistent with the customer-focused image they portray. We expected a more understanding and solution-oriented response, especially as loyal users. Unfortunately, this experience has left us questioning Notion's commitment to customer satisfaction and goodwill.",
    "date": "2024-11-26",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Bad experience with billing",
    "review": "",
    "date": "2024-11-26",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Site doesn't work most of the time. I'm using notion since 2020 I guess. Still can't make it my primary note taking app. Why? Cause there are millions of issues with the site. \nEven now I've sat do... See more",
    "date": "2024-12-28",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "I just received a change email address verification code from Notion.  I've never heard of Notion, nor do I have an account with them.  It's the weekend therefore I will have to wait to reach out to t... See more",
    "date": "2024-12-22",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Warning! Do not Pay for this shit, they will continue making withdrawals from your account after you cancel and it is impossible to get in touch with them. \nYesterday they withdrew 770USD from my acc... See more",
    "date": "2024-12-31",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Disappointed with Notion’s Inflexible Refund Policy: A Call for Better Customer Support",
    "review": "As the CEO of a company that has relied on Notion as an integral part of our operations, I must express my profound disappointment with their handling of our refund request. Despite providing detailed evidence that additional members were mistakenly added to our workspace and subsequently removed, Notion has refused to issue a refund, citing rigid and inflexible policies. While we respect the terms outlined on their Plans and Pricing page, their approach fails to consider the good faith efforts we made to rectify the mistake promptly. We only became aware of the charges upon reviewing our credit card statement, a delay caused by their lack of proactive notification mechanisms. Their refusal to accommodate such genuine situations raises serious concerns about customer service and satisfaction. As a long-standing subscriber, we expected better support and understanding from Notion. We hope this feedback prompts them to reconsider their policies and adopt a more empathetic approach to addressing customer concerns.",
    "date": "2024-11-24",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Originally a great product, now forces you to engage their AI and uses the 'free' platform to extort users",
    "review": "Whilst we originally had very high hopes for this product, and used it well professionally and personally for nearly two years, it has declined rapidly into a platform that force-feeds you the usage of a really lacklustre AI, that then offer a free platform that's seemingly purposely built to bait you into paying by unexpectedly locking all of your data in read-only until you do. The AI features have been added to more and more parts of the UI over time, to the point where it was put in where other UI elements used to be, resulting in frequent accidental clicks due to muscle memory. This then immediately starts the AI engaging with you, which a) means your data is now shared with it, and b) you're dragged off what you were doing, for a most likely incorrect answer. They also removed the option to disable the AI from the free and even paid plans, for some odd reason, and now you have to jump through hoops with their support platform. As for the free plan. It is free for collaborative use as long as you use less than 1000 'blocks', however, as of recently; They removed the ability to tell how many blocks are used - seemingly to bait people into using them and ending up in this stalemate position. They allow people to delete items to free up blocks, but only until they hit this (newly invisible) quota, then they lock their data read-only until you pay. They give no credit to any user in this situation also having paid workspaces and wanting to keep different sets of data separated. Eg we pay hundreds per year for my wife and I to have one workspace with unlimited, but we use that for our professional projects, so used a free one for our house activities like tasks and shopping lists. Same users, just a different workspace. They implemented an auto-delete feature for trashed items where the UI says old items will be deleted, but items trashed before that date actually don't get deleted. They don't have a 'empty trash' button, so users have to painstakingly manually remove things one by one if they want any hope of staying on the 'Free' tier at all. The UI shows the trash as empty once you remove enough items, another baiting tactic, so you may think that you've cleared the trash and freed up blocks (since now you cannot check), however, if you close and re-open Notion you'll find the trash is full again! They seemingly remove the warning about approaching the block limit, likely related to not showing it any more, so people don't know when to start paying more attention. Be warned!",
    "date": "2024-11-06",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Its ok to use but when it comes to…",
    "review": "Its ok to use but when it comes to renewing, and you want to downgrade you literally can't until you pay the bill for the a.i that you are trying to downgrade from.  If you try to remove the a.i first it says 'pay your invoice first' - a circlular loop of hopelessness that has just seen me pay for a year for something I don't want just so I can have the basic notion.  Five a.i generated generic emails from them none of them understanding what was happening and just telling me to remove the a.i from my account.  I explained it wouldn't let me till I paid the bill (that included the next year of a.i).  Awaiting a refund of £100 - fingers crossed.  now looking at other solutions.",
    "date": "2024-11-01",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Bad customer service and deceptive billing",
    "review": "Their entire app is setup in a way that's confusing, so be on guard they don't keep charging your \"workspace\" even if you no longer have an account. It's deceptive. Their customer service is condescending and not very helpful.",
    "date": "2024-10-28",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Deserves 10 Stars",
    "review": "For me, Notion is the most versatile Company Management Tool there is. It needs some time getting used to, to make full use of its potential. But then, it is just a joy to work with every day. They even have Notion Calendar, which is great, and Notion Mail will come soon. I am sure this will bring my productivity to a whole new level. Tasks, Meetings, Mail all in one platform. A dream.",
    "date": "2024-10-25",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Terrible customer service",
    "review": "Terrible customer service. They make it very easy to accidently upgrade to expensive business plan with single misclick which charges your card immediately. Customer service is then very slow to respond and incompetent and refuse to give back full refund. Would be a good platform if customer service was not terrible",
    "date": "2024-10-09",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Free version AMAZING",
    "review": "Free version AMAZING. Life changing.",
    "date": "2024-10-07",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Lots of competition...",
    "review": "Hard to see why this is better than alternatives for notes and connections between notes. Would rather use something cleaner and more straightforward like Apple Notes / Google Docs / Obsidian at most for all the interconnected notes.",
    "date": "2024-10-06",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Without a doubt super helpful",
    "review": "I started using notion around a few months ago. I use it for basic tracking of projects and organising each of these projects. It has been thoroughly useful to have all this is one place, seamlessly cross platformed (android phone, iPad and Chromebook). I also contacted recently regarding the lack of pinch zoom ability on iPad app, not a deal breaker, but wondered if there was a bug. Customer service was 100% excellent. They replied with thoroughness and although the feature is not available they put in a vote for the feature to be added. notion has without a doubt helped me towards achieving my projects",
    "date": "2024-10-03",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Nice product terrible service",
    "review": "The product is amazing, but if you have a problem, customer service is one of the worst I've seen.",
    "date": "2024-10-03",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Recently",
    "review": "Recently, I’ve been trying to cancel my membership and switch to the free version since I no longer wanted to pay for the subscription. However, I’m unable to remove my card, and they’ve charged me through an automatic deduction. When I reached out via email to request a refund, they claimed they couldn’t process it because it’s been more than three days since the invoice. But it’s their fault for taking too long to respond, and I have the receipts and everything showing how long they took. Now I’m stuck in this situation, even though it’s not my mistake. Their customer service is terrible. If you want to see them or have a look at them I am open to showing it to you guys :)) screw notion",
    "date": "2024-09-29",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "A dream that became a nightmare",
    "review": "When I first subscribed to Notion, I realized that they were not honest with pricing. They were showing prices without taxes and suddenly I discovered extra charges for VAT. Almost one year later, when it was about to renew, I discovered that the plan I have cost much more! I searched more on the relevant section and I discovered other invoices issued later, whitout any warning. I finlaty understood , that I had mistakenly activated some extra memers, due to a very delicate distinction between memebrs and quests. When I activated those extra memebrs, I thought it was free. They did not notify me but they charged my card whithout any warning! Looking at internet discussion and forums, there many people that had the same experience!",
    "date": "2024-09-06",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Account is blocked",
    "review": "Accounts are blocked based on geographic location",
    "date": "2024-09-06",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Scammer Company",
    "review": "In my bank history, I saw a $80 charge for notion. On August 20, I wrote to notion about the issue and asked them to cancel all subscriptions on my card. This time, on September 1, I received an invoice of around 120 dollars. They did not cancel my card and did not help me with my support. I couldn't avoid their scam until I canceled my credit card from my bank and changed the number. No customer satisfaction or proper communication, they just take as much money as they can. Never trust, you can find many similar and better applications. They caused me to lose more than $200 in total.",
    "date": "2024-09-01",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "The most discriminatory company",
    "review": "I made a mistake 3 years ago when I decided to buy a subscription and support the developers. Now I have been living in Europe for a long time and pay with a European card, but because I once paid with a Russian card, they will take away my recently paid subscription and all my data. Think about supporting them, because sooner or later it may come back to bite you.",
    "date": "2024-09-01",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Notion deletes accounts by nationality",
    "review": "Notion decided to delete all accounts and data (!), including free ones, of Russian users due to “sanctions”, which, by the way, do not limit the distribution of free software. This perfectly characterizes the company and its management. Think well before using Notion, maybe next time they will stop liking your nationality. I'm switching to a local open-source alternative and will never touch Notion again, even when they come back with an apology.",
    "date": "2024-08-27",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "They totally ripped us off!!",
    "review": "They totally ripped us off!!! My partner accidentally added users when trying to share documents. They had no understanding so we had to pay 5 times the bill that we should have had for a whole year! No consideration from their customer service!",
    "date": "2024-08-24",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "if you need to use it as task manager i…",
    "review": "if you need to use it as task manager i dont recommend it. i created all my docs and created teamspace and then it said i need to upgrade to use further. i didnt use it a lot but compare to trello for task management it sucks.",
    "date": "2024-08-20",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "They make it impossible to unsubscribe…",
    "review": "They make it impossible to unsubscribe from their marketing emails. Have been trying for more than 3 weeks to get unsubscribe one of our ex-employees. Unsubscribe links do not work, customer support is helpless and useless.",
    "date": "2024-08-16",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "All my data is gone",
    "review": "not reliable, you may lost all your data and there is no help from support  they told me ask another person to invite you to the project and still it didnt help.  I will never use online cloud based service for my notes . prefer to keep it local  and safe .",
    "date": "2024-07-28",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Site doesn't work most of the time. I'm using notion since 2020 I guess. Still can't make it my primary note taking app. Why? Cause there are millions of issues with the site. \nEven now I've sat do... See more",
    "date": "2024-12-28",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "I just received a change email address verification code from Notion.  I've never heard of Notion, nor do I have an account with them.  It's the weekend therefore I will have to wait to reach out to t... See more",
    "date": "2024-12-22",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Warning! Do not Pay for this shit, they will continue making withdrawals from your account after you cancel and it is impossible to get in touch with them. \nYesterday they withdrew 770USD from my acc... See more",
    "date": "2024-12-31",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Disappointed",
    "review": "Disappointed! Extremely Disappointed! I changed companies recently and I noticed that my notion was associated to my previous company email by mistake and I cannot change to the new one. I asked for support, I got a reply with the required information and I sent the information I could - 10 DAYS have passed and not a single word - nothing - not that we are working on it or the information is not valid please send something valid...but no reply at all...and I mentioned on the first email 13 days ago that it was urgent and still nothing. Stay away from them...I am being made hostage with my own information that I wrote in their app and I am desparate need and I don't any reply. Extremely disappointed service and I was a paid user...so it doesn't matter paid or free you will get treated like the bottom of the barrel and with no reply...at all! STAY AWAY.",
    "date": "2024-07-27",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Enjoy using notion a lot for my daily…",
    "review": "Enjoy using notion a lot for my daily work interface. Helps me set up my employees and gets them ready + assigned to tasks with no issue. It is limited on what you can do with the free plan, we upgraded to take care of that. I will continue to use the platform and update my review accordingly.",
    "date": "2024-07-26",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "I was willing to spend $10 for a…",
    "review": "I was willing to spend $10 for a monthly subscription to their inferior AI for the sake of having it within Notion instead of continually going back and forth between Notion and ChatGPT. Unfortunately, their subscription pop-ip is super unclear and I accidentally purchased an annual subscription thinking I was being offered a discount on the monthly rate. You actually have to do the math to see that the monthly rate in the box that looks as though its just a discounted monthly rate matches the box with the annual rate when multiplied by 12.   There's no other indicator that, by clicking, you're agreeing to pay $96 instead of $8.  And no purchase confirmation screen - one errant mouse click and I was out $96 that I can't afford right now. On their website, Notion says that they have a 72-hour refund policy on accidental purchases in general and 30 days on purchases of any annual plan.  But that requires the company to actually respond to customer service emails (which is the only way to reach them). I emailed them immediately, and it took a day for me to receive a boiler plate response (with an incorrect assessment of my situation saying that I wanted to downgrade from an annual to a monthly plan - I was so ticked at the confusing interface and lack of any systematized way of requesting a refund that I just wanted a refund), and also saying that my request was being escalated to their finance team, but that the finance team had a \"ticket backlog\" so I might not hear back for a day or so.  (I can guess why there's a ticket backlog with how confusing the purchase process is). It's now been a full work week, and despite multiple follow ups there's been no response from this finance team.   Yes, it's only been a week, but 1) $96 is a lot of money for some of us to be out for any amount of time when we didn't budget for it,  2) It's ridiculous that the matter of a simple refund needs to be \"escalated\" to a finance team at all - especially when they expound upon their \"no hassle\" refund policy on their own website.  If they were actually trying to make it no hassle, they'd empower their customer service reps to issue refunds for anything that clearly falls within their stated policies.  There's nothing to review here!  I requested a refund within minutes of purchase, and their policy says I'll be issued a refund if requested within 30 days!, and 3) It's a joke that a cutting edge tech company who boasts about their AI capabilities requires human review for this at all!   There should be a button on the billing page directly next to the charge where customer's can file a refund request.  The data verification (which basically amounts to \"is the purchase date within 30 days of the refund request? Y/N\") should be instantaneous. One last thing.  If you've got multiple work spaces on a single account, you should be aware that even if you did intend to pay $96 for their cruddy AI, it will only work within the workspace you're in when you purchase it.  There's absolutely no disclaimer to this effect, and this is different from any other app I've used where you can partition your use cases (here it's work vs personal).  I purchased this within my personal work space, which I hardly use, but would have to pay another $96 if I wanted to use it in my professional workspace.   I'm now realizing that this is a larger infrastructure problem where it's impossible to tell which settings are applied to you're account, and which ones are specific to individual workspaces. I've already had mounting privacy concerns about using Notion (who's business model is basically to give away the main product and generate revenue from selling your private data), and this lack of concern for customers just tipped me over to deleting the app.  I'm glad I never built it out as much as I wanted to. Buyer beware!",
    "date": "2024-07-13",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Absolute cowboys",
    "review": "Absolute cowboys. Notion \"gifted\" my company $1000 in credit to \"try notion out.\" The small print was that the credit expired after a year. We didn't use Notion. The account was wholly unused and dormant. With zero warnings, Notion quietly started charging us month after month. It took us the best part of a year to realise. They refused to refund anything other than the most recent month. Snakes.",
    "date": "2024-07-12",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Don't subscribe to this",
    "review": "Don't subscribe to this. It is really useless, and you can't unsubscribe. If you have a problem, don't try to solve it. There is no solution. The strategy is to drag out the issue until you're fed up. After 40 emails, I could not solve my simple problem. They automatically upgraded my account without asking me. When I wanted to fix their mistake, they asked me to pay for the days that I did not use the service. Unfortunately, they took the money and did not refund it. After 40 emails, I gave up and canceled my subscription.\"",
    "date": "2024-07-11",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "I couldn't cancel my subscription and they wanted to charge me for the whole year",
    "review": "My subscription period was coming to an end, I forgot to cancel it, and then wanted to do it in the settings, but it only allowed me to cancel my plan for the next year, not the current, I thought it was some kind of bug and did not have time to look into it further. I tried doing it multiple times, but it always worked only for the next billing period, and not for the current. Suddenly after some time my account was blocked and could be use only in the view mode. I email support, but it was not helpful at all. I see it as a misleading practice, they do not inform you enough about renewing your subscription, but when it happens, you cannot cancel it, and then they just block your account and keep charging you money.",
    "date": "2024-07-10",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Give it a try",
    "review": "I use this platform for many years every day. It's a great tool to manage you life and business.",
    "date": "2024-06-16",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Really hard to use",
    "review": "",
    "date": "2024-06-01",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "DONT SUBSCRIBE TO THIS",
    "review": "DONT SUBSCRIBE TO THIS. August this year I stopped my subscription. I can no longer log into my account, but motion have been taking money from my account ever since (12,50 USD/month). After 20+ mails there is still no solution. I have never experienced such bad customer service.",
    "date": "2024-05-17",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Be careful with Notion and its…",
    "review": "Be careful with Notion and its cancellation policy. - if you bought a useless AI module and after some time you want to cancel it, you will be refused and the money will not be returned and will not be credited for another product; - if you cancel a certain number of users in an annual subscription, you receive credits for the next year. Any requests for a refund will not work; - the support service is misleading, first confirms the possibility of changing the issued invoice, and after a week of deliberation says that it is impossible to change the invoice. If you have your own business, then you understand perfectly well that any invoice can be changed, refunded, and so on; - if you want to try Notion, never choose an annual plan, only a monthly one, otherwise, you will not be able to change anything, and you will be charged the maximum amount of money;",
    "date": "2024-05-16",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Second Class Customer",
    "review": "Notion treats android users as second class customers. They always choose to cater to Apple users even though Android has a larger customer base. Notion calendar was released and they have an iOS app but not an android app. The notion app for android is 100 times worse that the version for iOS. I will cancel my subscription and move on to someone that values my business and does not treat me like a second class customer.",
    "date": "2024-05-06",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Useful in the first year of the startup, then easy cancellation w",
    "review": "We used notion for a while when we started and was useful, and stopped using them about a year ago after moving all over to google workspace. We forgot to cancel the billing but when we noticed the charge they were quick to help cancel and refund, which is not normally the case (thank you Jim from the billing team)",
    "date": "2024-05-02",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Be careful what they charge !!",
    "review": "i wanted to use the plus package. I realized they charged for all my friends that we use together and charged me 1152 dollars !! I never signed for it. What kind of a package jumps from FREE to 1152 dollars per year. Also plus package doesn't give you a crazy features or something. I am so mad at them right now. I took the screenshots of how shady their plans pages and how they charge. BE CAREFUL ABOUT WHAT THEY ARE GOING TO CHARGE YOU ! YOU SUBSCRIBE AND THEY CHARGE YOU AFTER SOME TIME !",
    "date": "2024-04-27",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Notion user of 5 years",
    "review": "I have been using Notion for almost 5 years and I cannot stress more - my whole life is documented there! Recommend it to everyone!",
    "date": "2024-04-24",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Worst customer service out there",
    "review": "Is this what happens when they let \"tech people\" run their customer service. These people have no clue how to talk to people and will deflect the problem away from them as quickly as possible. Looks like a dying fade and I can see why.",
    "date": "2024-04-09",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Great app but expensive",
    "review": "I use it with some friends for studying and it is almost full, so we've decided to pay it but saw the price and it was to expensive.",
    "date": "2024-04-09",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Decent app",
    "review": "Decent app, with great options for sharing. Unfortunately it doesn't really work well for my purposes. Ended up going with SuperOkay, a client portal that leans more towards agency work.",
    "date": "2024-04-08",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Notion is just amazing!",
    "review": "Notion is just amazing!",
    "date": "2024-04-04",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Tried to retroactively bill me for…",
    "review": "Tried to retroactively bill me for services I did not use and locked access to the platform. Awful customer support and an absolutely lost company - avoid entirely.",
    "date": "2024-04-03",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Disappointed..",
    "review": "I actually really liked it at first but after noticing a few infuriating issues I decided it was not worth it anymore: 1. It is missing basic features like charts, which would be expected of a software like notion 2. I am not sure if the the desktop app is based on electron, but it has an obvious memory leak which has not been fixed for a very long time, notion alone uses over 1gb of ram on idle, which is wayyyy more than any browser uses. This should be the utmost priority as no customer would like a simple desktop app to use nearly as much resources",
    "date": "2024-04-02",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Site doesn't work most of the time. I'm using notion since 2020 I guess. Still can't make it my primary note taking app. Why? Cause there are millions of issues with the site. \nEven now I've sat do... See more",
    "date": "2024-12-28",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "I just received a change email address verification code from Notion.  I've never heard of Notion, nor do I have an account with them.  It's the weekend therefore I will have to wait to reach out to t... See more",
    "date": "2024-12-22",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Warning! Do not Pay for this shit, they will continue making withdrawals from your account after you cancel and it is impossible to get in touch with them. \nYesterday they withdrew 770USD from my acc... See more",
    "date": "2024-12-31",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Unauthorized credit card charge",
    "review": "Somebody added me into some kind of threat or workspace. I am not aware of this. No email notifications nothing. All of a sudden I see a charge on my credit card for a service I never signed up for. I contacted customer service asking to cancel my subscription and refund my money. So far they are footballing me. This is the first time I was charged for a service I never gave my consent. My experience with Notion.so has been unpleasant so far.",
    "date": "2024-04-01",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Charged my CC after cancellation",
    "review": "They charged my credit card after cancelation, and make it difficult to stop because you cannot remove or delete your billing info. You literally need to pay with a different card and then cancel that card. When cancelling their upgraded service and moving to \"FREE\" tier they will not let you know you are still enrolled in features that are paid that they have broken out into a different line item, so your account says \"Free\" but it's not. You need to un-enroll from each individual item which I suspect is done on purpose.",
    "date": "2024-03-31",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "I too find the app a bit fiddly but…",
    "review": "I too find the website a bit fiddly but can't fault the customer service. I accidentally permenantly deleted a file, got in touch with customer service through the AI chat function that connected me to real people whom replied almost straight away and were super kind, friendly and found the page with no fuss. Special thanks to Emma.",
    "date": "2024-03-29",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "I love Notion",
    "review": "I love Notion. As a forex trader I keep all my journals and lessons in Notion which has really been very helpful to me. Recently I made an error and deleted my six months journal. The team helped me retrieve it with ease. I can’t thank them enough. Shoutout to Violet, Dimitros, Maria, and Aimee. You guys made my day. Thanks so much",
    "date": "2024-03-26",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Difficulty loggin in",
    "review": "Difficulty loggin in. The logging mechanism crashes. Need to specially try from incognito. Doesn't work for my friends either. Extremely bad. Very surprise seeign that popular product with that critical bugs.",
    "date": "2024-03-26",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Just a pain",
    "review": "Using it for a long time. Let's keep it simple: Notion is just a pain in the ass. It is buggy and the content keeps disappearing, creating hours and hours of failed work, just creating frustration, problems and costs. I recommend anyone to try out other apps before dedicating themselves to this cursed service.",
    "date": "2024-03-25",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "is a just a great tool",
    "review": "",
    "date": "2024-03-21",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Notion for personal use",
    "review": "An EXCEPTIONAL notetaking app. Th creators have strode to make the app as user friendly as they possibly could From practicing and recording information for exams to using the app for work, this has become my most important application. However, based on others reviews, it seems that there are issues on the business side (I can't comment on this; this review is purely based on their free personal plan)",
    "date": "2024-03-18",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "I would not use Notion",
    "review": "I would not use Notion. I tried to use Notion for my business, I wanted a system that I could customize and set up to have all my needs in one platform. Notion looked like the best option. I needed communication, task reminders, video instructions and document transfers. Notion fit that need. However, from day 1 video would not consistently play. Than after having 10 additional users besides myself, simple pdf documents wouldn’t upload. I tried working with the support team for 6months to resolve the issue. But they would close my issue without a solution. They never fixed the problem. I recorded video after video showing them the problem but no solution ever came. The support team told me to stop sending in tickets because it would delay them from solving the problems. But they stoped communicating with me all together. Customer service is good to respond when you have a problem 7 days/week. Just don’t expect them to resolve any problems. Also, they will bill you and NOT send you a receipt or invoice informing you when they bill you. You will only learn of the charges from your CC bill. My business productivity was negatively impacted by using this service. Run away, do not trust your business with this project management tool.",
    "date": "2024-03-11",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Pricing is not clear unauthorised payment",
    "review": "I initially enjoyed using Notion until I upgraded to the paid plan. The pricing wasn't clear upfront, showing an amount without taxes and later charging with taxes included. Adding members (unclear difference from guests) without confirmation is a serious issue. They're charged the total amount for all added members without prior approval, leading to an unexpected expense of over €400. Improving transparency in pricing and introducing confirmation requests is crucial, especially for users worldwide, some of whom may not be fluent in English. Hoping to clarify with customer support, but current reviews raise concerns.",
    "date": "2024-03-05",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "I am so angry with Notion",
    "review": "I am so angry with Notion - all the hallmarks of a scam outfit. Difficult to cancel (you can't cancel directly with them, you have to do a merry dance through their convoluted menus. Repeated billing attempts even after they stated 'Last Attempt - Update Billing' numerous times (I moved money out of the account to cancel after having no joy online, or DIRECTLY WITH THEIR SUPPORT Wasted sooo much time on this only to be further out of pocket. DISGUSTING BEHAVIOUR - AVOID LIKE THE PLAGUE. Doesn't surprise me at all that they have so many 1* reviews, don't believe the positive ones for a moment. Looks like someone has been buying fake reviews. AVOID AVOID AVOID Also, worryingly - I just noticed after finally being able to cancel (a FREE PLAN mind) Monzo informs me that they have conducted an 'Active Card Check' ?? I had nothing owed so this is highly suspicious. If these guys have your details, I'd remove them ASAP. --- Professional companies usually respond... Why am I not surprised?",
    "date": "2024-02-27",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "I've tried every major relational…",
    "review": "I've tried every major relational database app out there. Some (Like Trello & ClickUp) I've used for MANY years. There's something unique and nice about Notion. Although it hasn't replaced other tools I use, I do seem to come back to it over and over. It has 'something' go for it.",
    "date": "2024-02-09",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "I've been using Notion for a while now",
    "review": "I've been using Notion for a while now. The flexibility to structure my information how I want is. Whether it's setting up project plans, creating to-do lists, or taking notes, Notion handles it all seamlessly. The collaborative features are a lifesaver for team projects, and the ability to switch between different views like tables, boards, and calendars keeps everything organized and accessible.",
    "date": "2024-02-09",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "I'm loving it",
    "review": "I've been not so open to use Notion. I know this solution from long time ago, and has been recently that I starting to use and loving it. I never needed help from their support, so I still don't know how they handle such kind of situations, but about the product I need to say that is amazing to organize personal and professional matters, for solo and teams, the way you can use databases (tables) with information is so powerful.",
    "date": "2024-02-08",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Worst part is just taking loading and…",
    "review": "Worst part is just taking loading and loading. Otherwise, features are good.",
    "date": "2024-01-22",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "Nothing bad to say",
    "review": "I've tried multiple task tracking softwares and even the free version of notion is amazing compared to some other where I paid for the same features yet they either worked painfully slow or had limits depending on price plan. I have no reason to upgrade at the moment since free has more than enough features but I figured I could at least give them a good review (maybe that counts for something) I am very happy with notion so far.",
    "date": "2024-01-18",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "a beautiful app",
    "review": "",
    "date": "2024-01-18",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Site doesn't work most of the time. I'm using notion since 2020 I guess. Still can't make it my primary note taking app. Why? Cause there are millions of issues with the site. \nEven now I've sat do... See more",
    "date": "2024-12-28",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "I just received a change email address verification code from Notion.  I've never heard of Notion, nor do I have an account with them.  It's the weekend therefore I will have to wait to reach out to t... See more",
    "date": "2024-12-22",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Warning! Do not Pay for this shit, they will continue making withdrawals from your account after you cancel and it is impossible to get in touch with them. \nYesterday they withdrew 770USD from my acc... See more",
    "date": "2024-12-31",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Site doesn't work most of the time. I'm using notion since 2020 I guess. Still can't make it my primary note taking app. Why? Cause there are millions of issues with the site. \nEven now I've sat do... See more",
    "date": "2024-12-28",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "I just received a change email address verification code from Notion.  I've never heard of Notion, nor do I have an account with them.  It's the weekend therefore I will have to wait to reach out to t... See more",
    "date": "2024-12-22",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  },
  {
    "title": "",
    "review": "Warning! Do not Pay for this shit, they will continue making withdrawals from your account after you cancel and it is impossible to get in touch with them. \nYesterday they withdrew 770USD from my acc... See more",
    "date": "2024-12-31",
    "rating": "Rated",
    "reviewer": "",
    "source": "Trustpilot"
  }
]